[
  {
    "id": 1,
    "name": "John and Jane's Love Story",
    "details": "John and Jane met on this marriage media website, and their connection was instant. They both shared a passion for travel and adventure. After chatting for weeks, they decided to meet in person, and it was love at first sight. Today, they are happily married and exploring the world together, making beautiful memories that will last a lifetime. Their story is a testament to the power of finding love online.",
 
    "pic": "https://images.unsplash.com/photo-1637870996864-65dc1c00f4dc?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxzZWFyY2h8MTV8fGNvdXBsZXxlbnwwfHwwfHx8MA%3D%3D&auto=format&fit=crop&w=800&q=60"
 
  },
  {
    "id": 2,
    "name": "Michael and Emily's Fairytale Romance",
    "details": "Michael and Emily's love story began when they both swiped right on each other's profiles. They quickly discovered their shared love for literature and classic movies. Over time, their virtual connection turned into a real-life fairytale. Michael proposed in a charming old bookstore, and Emily said yes without hesitation. They are now planning a romantic wedding, celebrating their love story inspired by the pages of their favorite novels.",
 
    "pic": "https://images.unsplash.com/photo-1521145239174-279dc2227166?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxzZWFyY2h8MzV8fGNvdXBsZXxlbnwwfHwwfHx8MA%3D%3D&auto=format&fit=crop&w=800&q=60"
 
  },
  {
    "id": 3,
    "name": "Daniel and Olivia's Long-Distance Love",
    "details": "Daniel and Olivia were separated by thousands of miles but found each other on this marriage media website. Despite the distance, their connection grew stronger every day. They spent countless hours on video calls, getting to know each other deeply. Finally, they closed the gap and are now happily living together, proving that love knows no boundaries.",
 
    "pic": "https://images.unsplash.com/photo-1501631259223-89d4e246ed23?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxzZWFyY2h8MzZ8fGNvdXBsZXxlbnwwfHwwfHx8MA%3D%3D&auto=format&fit=crop&w=800&q=60"
 
  },
  {
    "id": 4,
    "name": "Liam and Ava's Journey of Discovery",
    "details": "Liam and Ava's relationship began with a simple 'hello' on this marriage media website. What started as casual conversations turned into meaningful discussions about their dreams and aspirations. They encouraged each other to pursue their passions and dreams. Today, they are a power couple, supporting each other in every aspect of life, and their love continues to grow stronger.",
 
    "pic": "https://images.unsplash.com/photo-1494774157365-9e04c6720e47?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxzZWFyY2h8NTJ8fGNvdXBsZXxlbnwwfHwwfHx8MA%3D%3D&auto=format&fit=crop&w=800&q=60"
 
  },
  {
    "id": 5,
    "name": "Ethan and Sophia's Second Chance at Love",
    "details": "Ethan and Sophia both had experienced heartbreak before finding each other on this marriage media website. They connected over their shared experiences and realized that they were each other's second chance at love. Their relationship is built on trust, understanding, and the belief that true love can heal even the deepest wounds.",
 
    "pic": "https://images.unsplash.com/photo-1565128541365-2b16f6685458?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxzZWFyY2h8NTF8fGNvdXBsZXxlbnwwfHwwfHx8MA%3D%3D&auto=format&fit=crop&w=800&q=60"
 
  },
  {
    "id": 6,
    "name": "David and Lily's Whirlwind Romance",
    "details": "David and Lily's love story unfolded quickly after they matched on this marriage media website. They spent hours talking and getting to know each other's families. Within a few months, they decided to tie the knot in an intimate ceremony surrounded by loved ones. Their whirlwind romance proves that when you find the right person, you don't need to wait to start your happily ever after.",
 
    "pic": "https://images.unsplash.com/photo-1514415008039-efa173293080?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxzZWFyY2h8NzB8fGNvdXBsZXxlbnwwfHwwfHx8MA%3D%3D&auto=format&fit=crop&w=800&q=60"
 
  },
  {
    "id": 7,
    "name": "William and Grace's Cross-Cultural Connection",
    "details": "William and Grace's love story is a testament to the beauty of cross-cultural connections. They met on this marriage media website and instantly connected despite their different backgrounds. Their relationship is a blend of traditions, languages, and cuisines. Together, they are bridging gaps and celebrating the diversity of love.",
 
    "pic": "https://images.unsplash.com/photo-1528213049955-adbe6fe1dcbd?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxzZWFyY2h8OTB8fGNvdXBsZXxlbnwwfHwwfHx8MA%3D%3D&auto=format&fit=crop&w=500&q=60"
 
  },
  {
    "id": 8,
    "name": "Oliver and Mia's Love Beyond Borders",
    "details": "Oliver and Mia's love knows no borders. They met on this marriage media website and quickly discovered that they were soulmates. Despite living in different countries, they made it work through frequent visits and endless virtual dates. Today, they are married and planning to build a life together, proving that love can conquer any distance.",
 
    "pic": "https://images.unsplash.com/photo-1629888401525-0d11ff26881f?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxzZWFyY2h8OTR8fGNvdXBsZXxlbnwwfHwwfHx8MA%3D%3D&auto=format&fit=crop&w=500&q=60"
 
  },
  {
    "id": 9,
    "name": "Benjamin and Emma's Serendipitous Meeting",
    "details": "Benjamin and Emma's love story is full of serendipity. They both joined this marriage media website on a whim, never expecting to find their perfect match. But fate had other plans. Their profiles matched, and their first date turned into a lifelong journey. They cherish every moment together and are grateful for the unexpected love they found.",
 
    "pic": "https://images.unsplash.com/photo-1621621667797-e06afc217fb0?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxzZWFyY2h8OTZ8fGNvdXBsZXxlbnwwfHwwfHx8MA%3D%3D&auto=format&fit=crop&w=500&q=60"
 
  },
  {
    "id": 10,
    "name": "Lucas and Isabella's Musical Connection",
    "details": "Lucas and Isabella's love story is set to music. They bonded over their shared passion for music and spent countless hours jamming together. Their connection was so strong that it felt like a perfect melody. Today, they are making beautiful music as a married couple, living their love story one note at a time.",
 
    "pic": "https://plus.unsplash.com/premium_photo-1682390303346-196626ab1220?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxzZWFyY2h8MTE3fHxjb3VwbGV8ZW58MHx8MHx8fDA%3D&auto=format&fit=crop&w=500&q=60"
 
  }
]
